app/controllers/home_controller.rb

  def index
    @crypto = Cryptocurrency.all
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies"

  def show
    @crypto = Cryptocurrency.find_by(name: params[:name]).value
---
SELECT  "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."name" IS NULL LIMIT $1  [["LIMIT", 1]]